#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_service.students_api_docs will be created
  + resource "docker_service" "students_api_docs" {
      + id   = (known after apply)
      + name = "wbk-students-api-docs"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 8080
              + target_port    = 8080
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + runtime      = (known after apply)

          + container_spec {
              + image             = "ghcr.io/so-gineers/workbook-students-api-docs:1.0.0@sha256:2d4eaafe015888f24762461ef2fd7a678c94c8246b6fc46a7d9f0f433c1fe29c"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.rule"
                  + value = "Host(`docs.workbook-students.ml`)"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.teachers_api_docs will be created
  + resource "docker_service" "teachers_api_docs" {
      + id   = (known after apply)
      + name = "wbk-teachers-api-docs"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 8081
              + target_port    = 8080
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + runtime      = (known after apply)

          + container_spec {
              + image             = "ghcr.io/so-gineers/workbook-teachers-api-docs:1.0.0@sha256:a4f01c2f7f56395f6826480da0684d7566f5ced7e2b7c65c285005cb277c79c3"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.rule"
                  + value = "Host(`docs.workbook-teachers.ml`)"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.wbk_postgresql will be created
  + resource "docker_service" "wbk_postgresql" {
      + id   = (known after apply)
      + name = "wbk-postgresql"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 5432
              + target_port    = 5432
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + networks     = [
              + "traefik",
            ]
          + runtime      = (known after apply)

          + container_spec {
              + env               = {
                  + "POSTGRES_DB"       = "workbooker_api_production"
                  + "POSTGRES_PASSWORD" = "workbook"
                  + "POSTGRES_USER"     = "workbook"
                }
              + image             = "postgres:14.1"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = "5s"
                  + retries      = 4
                  + start_period = "0s"
                  + test         = [
                      + "CMD-SHELL",
                      + "pg_isready",
                      + "-U",
                      + "xaragne",
                    ]
                  + timeout      = "2s"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.wbk_rails_api will be created
  + resource "docker_service" "wbk_rails_api" {
      + id   = (known after apply)
      + name = "wbk-rails-api"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 4122
              + target_port    = 3000
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + networks     = [
              + "traefik",
            ]
          + runtime      = (known after apply)

          + container_spec {
              + env               = {
                  + "APP_JWT_AUDIENCE"          = "wbk/client/mobile"
                  + "APP_JWT_HASHING_ALGORITHM" = "HS512"
                  + "APP_JWT_ISSUER"            = "wbk/api/ruby"
                  + "RAILS_DB_HOST"             = "wbk-postgresql"
                  + "RAILS_DB_NAME"             = "workbooker_api_production"
                  + "RAILS_DB_PASSWORD"         = "workbook"
                  + "RAILS_DB_PORT"             = "5432"
                  + "RAILS_DB_USER"             = "workbook"
                }
              + image             = "ghcr.io/so-gineers/workbook-api:1.0.0@sha256:6393b529ca5235089c9d357c130c7802379f266994d0463d5c60b9991129424a"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.routers.railsapi.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.railsapi.rule"
                  + value = "Host(`workbook-api.ml`)"
                }
            }

          + log_driver {
              + name    = "json-file"
              + options = {
                  + "max-file" = "3"
                  + "max-size" = "10m"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.wbk_social_media_images_service will be created
  + resource "docker_service" "wbk_social_media_images_service" {
      + id   = (known after apply)
      + name = "wbk-social-media-api"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 4126
              + target_port    = 3000
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + runtime      = (known after apply)

          + container_spec {
              + image             = "ghcr.io/so-gineers/workbook-sm-images:1.0.0-1.16@sha256:433d60d7ffc9a3697fb61b8573cf23695ce0dde050d467fc383db2c716ad9051"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.wbk_students_frontend will be created
  + resource "docker_service" "wbk_students_frontend" {
      + id   = (known after apply)
      + name = "wbk-students-frontend"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 4128
              + target_port    = 3000
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + runtime      = (known after apply)

          + container_spec {
              + image             = "ghcr.io/so-gineers/workbook-api:1.0.0@sha256:6393b529ca5235089c9d357c130c7802379f266994d0463d5c60b9991129424a"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.studentsfrontend.rule"
                  + value = "Host(`workbook-students.ml`)"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # docker_service.wbk_teachers_frontend will be created
  + resource "docker_service" "wbk_teachers_frontend" {
      + id   = (known after apply)
      + name = "wbk-teachers-frontend"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "ingress"
              + published_port = 4124
              + target_port    = 3000
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + networks     = [
              + "traefik",
            ]
          + runtime      = (known after apply)

          + container_spec {
              + env               = {
                  + "NEXT_AUTH_TOKEN" = "atoken"
                  + "RAILS_API_URL"   = ""
                }
              + image             = "ghcr.io/so-gineers/workbook-teachers:1.0.0-node-nodejs-16@sha256:b8c838f3a9ce12d5d66d0028e5ff71158d11edb4936a9dd59b346c91a88f3be2"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.routers.teachersfrontend.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.teachersfrontend.rule"
                  + value = "Host(`workbook-teachers.ml`)"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # module.docker-traefik.docker_config.traefik-yaml will be created
  + resource "docker_config" "traefik-yaml" {
      + data = "bG9nOgogICAgbGV2ZWw6IGluZm8KCmVudHJ5UG9pbnRzOgogICAgaHR0cDoKICAgICAgYWRkcmVzczogIjo4MCIKICAgIGh0dHBzOgogICAgICBhZGRyZXNzOiAiOjQ0MyIKCiMgRG9ja2VyIFByb3ZpZGVyCnByb3ZpZGVyczoKICAgIGRvY2tlcjoKICAgICAgZW5kcG9pbnQ6ICJ1bml4Oi8vL3Zhci9ydW4vZG9ja2VyLnNvY2siCiAgICAgIG5ldHdvcms6ICJ0cmFlZmlrIgogICAgICBzd2FybU1vZGU6IGZhbHNlCiAgICAgIGV4cG9zZWRCeURlZmF1bHQ6IGZhbHNlCgojIEVuYWJsZSBkYXNoYm9hcmQKYXBpOgogICAgZGFzaGJvYXJkOiB0cnVlCgojIExldCdzIEVuY3J5cHQKY2VydGlmaWNhdGVzUmVzb2x2ZXJzOgogICAgbGV0c0VuY3J5cHQ6CiAgICAgICAgYWNtZToKICAgICAgICAgICAgZW1haWw6ICJ4YXJhZ25lQHNvLWdpbmVlcnMuY29tIgogICAgICAgICAgICBjYVNlcnZlcjogaHR0cHM6Ly9hY21lLXYwMi5hcGkubGV0c2VuY3J5cHQub3JnL2RpcmVjdG9yeSAjIFVzZSBMZXQncyBFbmNyeXB0IHN0YWdpbmcgc2VydmVyIHdoZW4gZXhwZXJpbWVudGluZyB0byBhdm9pZCBoaXR0aW5nIExldCdzIEVuY3J5cHRzIHJhdGUgbGltaXQKICAgICAgICAgICAgc3RvcmFnZTogL2V0Yy90cmFlZmlrL2FjbWUvYWNtZS5qc29uCiAgICAgICAgICAgIGtleVR5cGU6ICJSU0EyMDQ4IgogICAgICAgICAgICBodHRwQ2hhbGxlbmdlOgogICAgICAgICAgICAgICAgIyB1c2VkIGR1cmluZyB0aGUgY2hhbGxlbmdlCiAgICAgICAgICAgICAgICBlbnRyeVBvaW50OiBodHRwCiAgICBsZXRzRW5jcnlwdFN0YWdpbmc6CiAgICAgICAgYWNtZToKICAgICAgICAgICAgZW1haWw6ICJ4YXJhZ25lQHNvLWdpbmVlcnMuY29tIgogICAgICAgICAgICBjYVNlcnZlcjogaHR0cHM6Ly9hY21lLXN0YWdpbmctdjAyLmFwaS5sZXRzZW5jcnlwdC5vcmcvZGlyZWN0b3J5CiAgICAgICAgICAgIHN0b3JhZ2U6IC9ldGMvdHJhZWZpay9hY21lL2FjbWUuanNvbgogICAgICAgICAgICBrZXlUeXBlOiAiUlNBMjA0OCIKICAgICAgICAgICAgaHR0cENoYWxsZW5nZToKICAgICAgICAgICAgICAgICMgdXNlZCBkdXJpbmcgdGhlIGNoYWxsZW5nZQogICAgICAgICAgICAgICAgZW50cnlQb2ludDogaHR0cAoKCmFjY2Vzc0xvZzoge30KCm1ldHJpY3M6CiAgICBwcm9tZXRoZXVzOgogICAgICAgIGJ1Y2tldHM6CiAgICAgICAgLSAwLjEKICAgICAgICAtIDAuMwogICAgICAgIC0gMS4yCiAgICAgICAgLSA1CiAgICAgICAgbWFudWFsUm91dGluZzogdHJ1ZQ=="
      + id   = (known after apply)
      + name = (known after apply)
    }

  # module.docker-traefik.docker_network.network will be created
  + resource "docker_network" "network" {
      + attachable      = true
      + check_duplicate = true
      + driver          = "overlay"
      + id              = (known after apply)
      + internal        = (known after apply)
      + ipam_driver     = "default"
      + name            = "traefik"
      + options         = (known after apply)
      + scope           = (known after apply)

      + ipam_config {
          + aux_address = (known after apply)
          + gateway     = (known after apply)
          + ip_range    = (known after apply)
          + subnet      = (known after apply)
        }
    }

  # module.docker-traefik.docker_service.traefik will be created
  + resource "docker_service" "traefik" {
      + id   = (known after apply)
      + name = "traefik"

      + endpoint_spec {
          + mode = (known after apply)

          + ports {
              + protocol       = "tcp"
              + publish_mode   = "host"
              + published_port = 80
              + target_port    = 80
            }
          + ports {
              + protocol       = "tcp"
              + publish_mode   = "host"
              + published_port = 443
              + target_port    = 443
            }
        }

      + labels {
          + label = (known after apply)
          + value = (known after apply)
        }

      + mode {
          + global = (known after apply)

          + replicated {
              + replicas = (known after apply)
            }
        }

      + task_spec {
          + force_update = (known after apply)
          + networks     = [
              + "traefik",
            ]
          + runtime      = (known after apply)

          + container_spec {
              + env               = {
                  + "CF_API_EMAIL"      = ""
                  + "CF_API_KEY"        = ""
                  + "CF_DNS_API_TOKEN"  = ""
                  + "CF_ZONE_API_TOKEN" = ""
                }
              + image             = "traefik:2.6.0"
              + isolation         = "default"
              + stop_grace_period = (known after apply)

              + configs {
                  + config_id   = (known after apply)
                  + config_name = (known after apply)
                  + file_gid    = "0"
                  + file_mode   = 292
                  + file_name   = "/traefik.yaml"
                  + file_uid    = "0"
                }

              + dns_config {
                  + nameservers = (known after apply)
                  + options     = (known after apply)
                  + search      = (known after apply)
                }

              + healthcheck {
                  + interval     = (known after apply)
                  + retries      = (known after apply)
                  + start_period = (known after apply)
                  + test         = (known after apply)
                  + timeout      = (known after apply)
                }

              + labels {
                  + label = "traefik.enable"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.middlewares.https_redirect.redirectscheme.permanent"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.middlewares.https_redirect.redirectscheme.scheme"
                  + value = "https"
                }
              + labels {
                  + label = "traefik.http.middlewares.traefik-basic-auth.basicauth.removeheader"
                  + value = "true"
                }
              + labels {
                  + label = "traefik.http.middlewares.traefik-basic-auth.basicauth.users"
                  + value = (known after apply)
                }
              + labels {
                  + label = "traefik.http.routers.http_catchall.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.http_catchall.middlewares"
                  + value = "https_redirect"
                }
              + labels {
                  + label = "traefik.http.routers.http_catchall.rule"
                  + value = "HostRegexp(`{any:.+}`)"
                }
              + labels {
                  + label = "traefik.http.routers.metrics.entrypoints"
                  + value = "http"
                }
              + labels {
                  + label = "traefik.http.routers.metrics.middlewares"
                  + value = "traefik-basic-auth"
                }
              + labels {
                  + label = "traefik.http.routers.metrics.rule"
                  + value = "Host(`traefik`) && PathPrefix(`/metrics`)"
                }
              + labels {
                  + label = "traefik.http.routers.metrics.service"
                  + value = "prometheus@internal"
                }
              + labels {
                  + label = "traefik.http.routers.traefik.entrypoints"
                  + value = "https"
                }
              + labels {
                  + label = "traefik.http.routers.traefik.middlewares"
                  + value = "traefik-basic-auth"
                }
              + labels {
                  + label = "traefik.http.routers.traefik.rule"
                  + value = "Host(`workbook-traefik.ml`)"
                }
              + labels {
                  + label = "traefik.http.routers.traefik.service"
                  + value = "api@internal"
                }
              + labels {
                  + label = "traefik.http.routers.traefik.tls.certresolver"
                  + value = "letsEncryptStaging"
                }

              + mounts {
                  + read_only = false
                  + source    = "traefik_acme"
                  + target    = "/etc/traefik/acme"
                  + type      = "volume"
                }
              + mounts {
                  + read_only = true
                  + source    = "/var/run/docker.sock"
                  + target    = "/var/run/docker.sock"
                  + type      = "bind"
                }
            }

          + placement {
              + constraints  = (known after apply)
              + max_replicas = (known after apply)
              + prefs        = (known after apply)

              + platforms {
                  + architecture = (known after apply)
                  + os           = (known after apply)
                }
            }

          + resources {
              + limits {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)
                }

              + reservation {
                  + memory_bytes = (known after apply)
                  + nano_cpus    = (known after apply)

                  + generic_resources {
                      + discrete_resources_spec = (known after apply)
                      + named_resources_spec    = (known after apply)
                    }
                }
            }

          + restart_policy {
              + condition    = (known after apply)
              + delay        = (known after apply)
              + max_attempts = (known after apply)
              + window       = (known after apply)
            }
        }
    }

  # module.docker-traefik.docker_volume.traefik_acme will be created
  + resource "docker_volume" "traefik_acme" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "traefik_acme"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + acme_mountpoint             = (known after apply)
  + traefik_network_name        = "traefik"
  + traefik_service_config_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"

```

</details>

*Pusher: @papapathe, Action: `pull_request`, Working Directory: ``, Workflow: `.github/workflows/terraform.yml`*